## DataFrame

In [1]:
import pandas as pd
import numpy as np

In [2]:
myData = np.random.randint(5,size = (4,3) )
myData

array([[1, 0, 1],
       [2, 0, 2],
       [2, 2, 0],
       [1, 0, 4]])

In [3]:
myDataFrame = pd.DataFrame(myData)

In [4]:
myDataFrame

   0  1  2
0  1  0  1
1  2  0  2
2  2  2  0
3  1  0  4

In [5]:
yeniDFrame = pd.DataFrame( myData , index = ["Omer", "Oguz", "Celik", "Naber"], columns = ["Maas", "Yas", "Calisma Saati"])
yeniDFrame

       Maas  Yas  Calisma Saati
Omer      1    0              1
Oguz      2    0              2
Celik     2    2              0
Naber     1    0              4

In [6]:
yeniDFrame["Yas"]

Omer     0
Oguz     0
Celik    2
Naber    0
Name: Yas, dtype: int32

In [7]:
yeniDFrame["Calisma Saati"]

Omer     1
Oguz     2
Celik    0
Naber    4
Name: Calisma Saati, dtype: int32

In [8]:
yeniDFrame[ ["Maas","Yas" ] ]

       Maas  Yas
Omer      1    0
Oguz      2    0
Celik     2    2
Naber     1    0

In [9]:
yeniDFrame.loc["Omer"]

Maas             1
Yas              0
Calisma Saati    1
Name: Omer, dtype: int32

In [10]:
    yeniDFrame

       Maas  Yas  Calisma Saati
Omer      1    0              1
Oguz      2    0              2
Celik     2    2              0
Naber     1    0              4

In [11]:
yeniDFrame["Emeklilik Yasi"] = yeniDFrame["Yas"]*2
yeniDFrame

       Maas  Yas  Calisma Saati  Emeklilik Yasi
Omer      1    0              1               0
Oguz      2    0              2               0
Celik     2    2              0               4
Naber     1    0              4               0

In [12]:
yeniDFrame

       Maas  Yas  Calisma Saati  Emeklilik Yasi
Omer      1    0              1               0
Oguz      2    0              2               0
Celik     2    2              0               4
Naber     1    0              4               0

In [13]:
#yeniDFrame.drop(columns=["level_0"], inplace=True)

In [14]:
yeniDFrame

       Maas  Yas  Calisma Saati  Emeklilik Yasi
Omer      1    0              1               0
Oguz      2    0              2               0
Celik     2    2              0               4
Naber     1    0              4               0

## Multi İndex

In [15]:
ilkIndexler = ["Apple","Apple","Apple","Xiaomi","Xiaomi","Xiaomi"]

In [16]:
icIndexler = ["iPhone","Mac","iPad","RedMi","Haylou","Pro"]

In [17]:
birlesmisIndex = list(zip(ilkIndexler,icIndexler))
birlesmisIndex

[('Apple', 'iPhone'),
 ('Apple', 'Mac'),
 ('Apple', 'iPad'),
 ('Xiaomi', 'RedMi'),
 ('Xiaomi', 'Haylou'),
 ('Xiaomi', 'Pro')]

In [18]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)
birlesmisIndex

MultiIndex([( 'Apple', 'iPhone'),
            ( 'Apple',    'Mac'),
            ( 'Apple',   'iPad'),
            ('Xiaomi',  'RedMi'),
            ('Xiaomi', 'Haylou'),
            ('Xiaomi',    'Pro')],
           )

In [19]:
benimTeknolojiListesi = [[40,"A"],[30,"B"] , [40,"A"],[30,"B"] ,[40,"A"],[30,"B"]]

In [20]:
teknolojiNumpyDizisi = np.array(benimTeknolojiListesi)
benimTeknolojiListesi

[[40, 'A'], [30, 'B'], [40, 'A'], [30, 'B'], [40, 'A'], [30, 'B']]

In [21]:
teknolokiDataFrame = pd.DataFrame(teknolojiNumpyDizisi, index= birlesmisIndex, columns=["Fiyat","Isim"])

In [22]:
teknolokiDataFrame

              Fiyat Isim
Apple  iPhone    40    A
       Mac       30    B
       iPad      40    A
Xiaomi RedMi     30    B
       Haylou    40    A
       Pro       30    B

### Eksik Veriler

In [23]:
havaDurumuDataFrame = pd.DataFrame( {"Istanbul": [30, 29, np.nan] , "Ankara" : [20,np.nan,25], "Izmir" : [40,38,38] })

In [24]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     38
2       NaN    25.0     38

In [25]:
havaDurumuDataFrame["Günler"] = günlerDizi["Pzt", "Salı", " Cars"]

NameError: name 'günlerDizi' is not defined

In [27]:
günlerDizi = ["Pzt", "Salı", " Cars"]

In [28]:
havaDurumuDataFrame["Günler"] = günlerDizi

In [29]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir Günler
0      30.0    20.0     40    Pzt
1      29.0     NaN     38   Salı
2       NaN    25.0     38   Cars

In [33]:
havaDurumuDataFrame.set_index("Günler")

        Istanbul  Ankara  Izmir
Günler
Pzt         30.0    20.0     40
Salı        29.0     NaN     38
 Cars        NaN    25.0     38

In [35]:
havaDurumuDataFrame.dropna() #NaN olan tüm satırlar gitti

   Istanbul  Ankara  Izmir Günler
0      30.0    20.0     40    Pzt

In [41]:
havaDurumuDataFrame = havaDurumuDataFrame.drop("Günler",axis = 1)

In [43]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     38
2     38

In [44]:
yeniVeri = pd.DataFrame( {"Istanbul": [30, 29, np.nan] , "Ankara" : [20,np.nan,25], "Izmir" : [40,38,38], "Antalya" : [45,np.nan,np.nan] })

In [49]:
yeniVeri

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     38      NaN
2       NaN    25.0     38      NaN

In [46]:
yeniDataFrame = pd.DataFrame(yeniVeri)

In [51]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     38      NaN
2       NaN    25.0     38      NaN

In [54]:
#2 NaNları atalım 1 NaNlar Kalsın
yeniDataFrame.dropna(axis=1 , thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     38
2       NaN    25.0     38

In [55]:
#NaN ları dolduralım
yeniDataFrame.fillna(0)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     0.0     38      0.0
2       0.0    25.0     38      0.0

### Pandas Operasyonlar

### Groupby

In [61]:
maasSozlugu = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"] , 
              "Çalışan Isim" : ["Ahmet", "Mehmet", "Atil", "Burak", "Zeynep", "Fatma"],
               "Maas" : [100,200,30,400,500,600]
              }

In [63]:
maasDataFrame = pd.DataFrame(maasSozlugu)
maasDataFrame

   Departman Çalışan Isim  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   200
2  Pazarlama         Atil    30
3  Pazarlama        Burak   400
4      Hukuk       Zeynep   500
5      Hukuk        Fatma   600

In [69]:
grupObjesi = maasDataFrame.groupby("Departman")
grupObjesi.count() #aynı departmandakilerin sayısı

           Çalışan Isim  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [70]:
grupObjesi.mean() #Ortalama Maasları

           Maas
Departman
Hukuk       550
Pazarlama   215
Yazılım     150

In [73]:
grupObjesi.min() #en az alanalar

          Çalışan Isim  Maas
Departman
Hukuk            Fatma   500
Pazarlama         Atil    30
Yazılım          Ahmet   100

In [74]:
grupObjesi.max()

          Çalışan Isim  Maas
Departman
Hukuk           Zeynep   600
Pazarlama        Burak   400
Yazılım         Mehmet   200

In [76]:
grupObjesi.describe() #Tüm özellikleri

           Maas
          count   mean         std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0   70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  215.0  261.629509   30.0  122.5  215.0  307.5  400.0
Yazılım     2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0

## Contact concatenation

In [78]:
sozluk1 = {"Isim": ["Ahmet", "Mehmet", "Veli"],
           "Spor" : ["Bisiklet","Koşu","Yüzme"],
           "Kalori" : [100,200,300]
          }
dataFrame1 = pd.DataFrame(sozluk1 , index=[0,1,2])
dataFrame1

     Isim      Spor  Kalori
0   Ahmet  Bisiklet     100
1  Mehmet      Koşu     200
2    Veli     Yüzme     300

In [79]:
sozluk2 = {"Isim": ["Ayse", "Fatma", "Aslı"],
           "Spor" : ["Tenis","F1","Dalıs"],
           "Kalori" : [100,200,300]
          }
dataFrame2 = pd.DataFrame(sozluk1 , index=[4,5,6])

In [80]:
sozluk3 = {"Isim": ["Ezgi", "Elis", "Ası"],
           "Spor" : ["Basket","F1","Futbol"],
           "Kalori" : [300,500,300]
          }
dataFrame3 = pd.DataFrame(sozluk1 , index=[7,8,9])

In [81]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

     Isim      Spor  Kalori
0   Ahmet  Bisiklet     100
1  Mehmet      Koşu     200
2    Veli     Yüzme     300
4   Ahmet  Bisiklet     100
5  Mehmet      Koşu     200
6    Veli     Yüzme     300
7   Ahmet  Bisiklet     100
8  Mehmet      Koşu     200
9    Veli     Yüzme     300

## Merge (Birleştirme / Kaynaştırma)

In [87]:
mergeSozluk1 = {"Isim": ["Ayse", "Fatma", "Aslı"],
           "Spor" : ["Tenis","F1","Dalıs"],
          }
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)
mergeDataFrame1

    Isim   Spor
0   Ayse  Tenis
1  Fatma     F1
2   Aslı  Dalıs

In [88]:
mergeSozluk2 = {"Isim": ["Ayse", "Fatma", "Aslı"],
           "Kalori" : [100,200,300]
          }
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)
mergeDataFrame2

    Isim  Kalori
0   Ayse     100
1  Fatma     200
2   Aslı     300

In [89]:
pd.merge(mergeDataFrame1,mergeDataFrame2 , on = "Isim") # ortak olanı on ile

    Isim   Spor  Kalori
0   Ayse  Tenis     100
1  Fatma     F1     200
2   Aslı  Dalıs     300